
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        1 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                        |
|:--------:|:---------------------------------------------------------------------------------|
|    🟢    | `module.repos["osv-scanner"].github_actions_secret.secret["AWS_DEFAULT_REGION"]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["osv-scanner"].github_actions_secret.secret["AWS_DEFAULT_REGION"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "osv-scanner"
      + secret_name     = "AWS_DEFAULT_REGION"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with module.infrahouse-github-backup.aws_s3_bucket_lifecycle_configuration.infrahouse-backup,
  on .terraform/modules/infrahouse-github-backup/s3.tf line 36, in resource "aws_s3_bucket_lifecycle_configuration" "infrahouse-backup":
  36:     filter {}

No attribute specified when one (and only one) of
[rule[0].filter[0].prefix.<.object_size_greater_than,rule[0].filter[0].prefix.<.object_size_less_than,rule[0].filter[0].prefix.<.and,rule[0].filter[0].prefix.<.tag]
is required

This will be an error in a future version of the provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMSwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>